Tekla.Structures.Model.ClashCheckHandler
The ClashCheckHandler class contains clash check methods.
using Tekla.Structures.Model;
public class Example
{
public void Exmaple1()
{
Model MyModel = new Model();
ClashCheckHandler ClashCheck = MyModel.GetClashCheckHandler();
ClashCheck.RunClashCheck();
ClashCheck.StopClashCheck();
}
}

Tekla.Structures.Model.ClashCheckHandler.#ctor
Internal constructor for ClashCheckHandler.
Should be instantiated only from Model.

Tekla.Structures.Model.ClashCheckHandler.RunClashCheck
Starts the clash checking. Uses advanced options sa option values.
Returns: True on success.

Tekla.Structures.Model.ClashCheckHandler.RunClashCheckWithOptions(System.Boolean,System.Boolean,System.Double,System.Boolean)
Starts the clash checking with options.
betweenReferenceModels: True, if clash check should be performed between reference models.
objectsInsideReferenceModels: True, if clash check should be performed to objects inside reference models.
minDistance: The minimum distance value.
betweenParts: True, if clash check should be performed between native parts.
Returns: True on success.

Tekla.Structures.Model.ClashCheckHandler.RunClashCheckWithOptions(System.Boolean,System.Boolean,System.Boolean,System.Double,System.Boolean)
Starts the clash checking with options.
betweenReferenceModels: True, if clash check should be performed between reference models.
betweenReferenceModelsAndComponents: True, if clash cehck should be performed between reference models and components.
objectsInsideReferenceModels: True, if clash check should be performed to objects inside reference models.
minDistance: The minimum distance value.
betweenParts: True, if clash check should be performed between native parts.
Returns: True on success.

Tekla.Structures.Model.ClashCheckHandler.StopClashCheck
Stops the clash checking.
Returns: True on success.
Remarks: Stops the clash check only when the Advanced Options' XS_USE_NEW_CLASH_CHECK is set.

Tekla.Structures.Model.ClashCheckHandler.GetIntersectionBoundingBoxes(Tekla.Structures.Identifier,Tekla.Structures.Identifier)
Get a list of bounding boxes (AABB) of the clashing volumes of two objects.
ID1: The identifier of the first object.
ID2: The identifier of the second object.
Returns: A list of bounding boxes of the clashing volumes.